Repository: eputnam/eputnam-i18ndemo
Catalog: locales/*/eputnam-i18ndemo.po
Languages: fi

source: i18ndemo_fact: this is a raise from a custom fact from eputnam-i18ndemo
fi: i18ndemo_fact: tämä on korotus mukautetusta tosiasiasta eputnam-i18ndemo

source: I18ndemo module puppet face example.
fi: I18ndemo-moduulin nukke-kasvot esimerkki.

source: Summary of help for the test_face action.
fi: Yhteenveto test_face-toiminnon ohjeista

source: i18ndemo test_face got invoked
fi: i18ndemo test_face sai kutsun

source: IT'S HAPPY FUN TIME
fi: SE ON HAUSKAA AIKAA

source: Creating i18ndemo_type.
fi: Luodaan i18ndemo_type.

source: Destroying list.
fi: Tuhota luettelo.

source: Does i18ndemo_type exist?
fi: Onko i18ndemo_type olemassa?

source: instances warning message from i18ndemo_type
fi: instances varoitusviesti 18ndemo_type

source: The name parameter takes a variable of upper and lower case characters A-Za-z
fi: Nimiparametri ottaa suuren ja pienikokoisen merkin A-Za-z muuttujan

source: Value %{v} is not a valid value for i18ndemo_type::name
fi: Arvo %{v} ei ole kelvollinen arvo i18ndemo_type::name

source: Good value for i18ndemo_type::name
fi: Hyvä arvo i18ndemo_type::name

source: The dir parameter takes a directory path to inspect.
fi: Dir-parametri ottaa hakemistopolun tarkistettavaksi.

source: %{v} is not a valid directory
fi: %{v} ei ole kelvollinen hakemisto

source: Module to demo i18n functionality.
fi: Moduuli demo i18n toiminnallisuuteen.

source: Failed to create %{filename} file.
fi: %{filename} tiedostoa ei voitu luoda.
